{
  "manifest": {
    "id": "backup-1764726711683",
    "timestamp": 1764726711683,
    "noteCount": 4,
    "linksAdded": 4,
    "notePaths": [
      "obsidian.main.vault/PayPal - Offensive Security Engineer/00 - Threat Emulation - Purple Team/Red - Purple Team Threat Emulation.md",
      "obsidian.main.vault/Notes/Tell Me About Yourself.md",
      "obsidian.main.vault/Job Interview Prep/Rapid7/Interview Prep/Behavioral/Difficult Person.md",
      "obsidian.main.vault/Job Interview Prep/General Atomics/2 - Cyber Architect - Responsibilities.md"
    ],
    "description": "Batch auto-link: 4 links added to 4 notes",
    "noteDetails": [
      {
        "path": "obsidian.main.vault/PayPal - Offensive Security Engineer/00 - Threat Emulation - Purple Team/Red - Purple Team Threat Emulation.md",
        "title": "Red - Purple Team Threat Emulation",
        "linksAdded": 1,
        "contentLength": 5413
      },
      {
        "path": "obsidian.main.vault/Notes/Tell Me About Yourself.md",
        "title": "Tell Me About Yourself",
        "linksAdded": 1,
        "contentLength": 2107
      },
      {
        "path": "obsidian.main.vault/Job Interview Prep/Rapid7/Interview Prep/Behavioral/Difficult Person.md",
        "title": "Difficult Person",
        "linksAdded": 1,
        "contentLength": 1881
      },
      {
        "path": "obsidian.main.vault/Job Interview Prep/General Atomics/2 - Cyber Architect - Responsibilities.md",
        "title": "2 - Cyber Architect - Responsibilities",
        "linksAdded": 1,
        "contentLength": 4663
      }
    ],
    "triggeredBy": "batch-autolink",
    "pluginVersion": "1.0.0"
  },
  "notes": [
    {
      "path": "obsidian.main.vault/PayPal - Offensive Security Engineer/00 - Threat Emulation - Purple Team/Red - Purple Team Threat Emulation.md",
      "content": "# Red & Purple Team Threat Emulation Knowledge Pack\n\n## I. Planning & Threat Modeling\n\n### What is threat emulation and how is it different from penetration testing?\n- Threat emulation simulates a real adversary’s TTPs across the full kill chain.\n- Focus is on realism, persistence, stealth, and achieving objectives.\n- Penetration testing usually targets vulnerabilities and reports findings; threat emulation is broader and often without immediate remediation goals.\n\n### How do you model an adversary?\n- Choose based on:\n  - Industry relevance (e.g., APT29 for gov, APT37 or FIN7 for financial).\n  - Threat intel from Mandiant, CISA, CTI providers.\n- Map their TTPs using [[MITRE ATT&CK]] or custom kill chains.\n- Use VECTR or SCYTHE for adversary emulation planning.\n\n### What frameworks do you use to guide emulation?\n- MITRE ATT&CK – TTP catalog and mapping.\n- Cyber Kill Chain – Structured attack lifecycle.\n- NIST 800-53 / CSF – Helps align with controls during purple teaming.\n- D3FEND – Detection counterpart to ATT&CK (useful for purple teams).\n\n## II. Initial Access Techniques\n\n### What are common initial access methods?\n- Phishing (link, attachment, OAuth consent).\n- Drive-by compromise (watering holes, exploit kits).\n- Supply chain abuse (malicious updates/scripts).\n- Valid accounts (credential stuffing, reused passwords).\n- Physical drops (Rogue devices, USB drops).\n\n### What payloads or tools are commonly used?\n- Office documents with DDE, OneNote, or macro exploits.\n- HTA, ISO, LNK files embedded in ZIPs.\n- Custom droppers in Go, Nim, Rust (bypass AV/EDR).\n- Payload staging via HTTPS, DNS, or cloud storage.\n\n## III. Command & Control (C2)\n\n### What are common C2 techniques?\n- HTTPS over trusted domains (mimic Outlook, Google).\n- DNS tunneling (covert channels).\n- C2 via cloud (OneDrive, Dropbox APIs).\n- Social media-based C2 (Twitter, Reddit).\n- Domain fronting (e.g., using Cloudflare or Akamai CDN).\n\n### What tools are used for C2?\n- Sliver, Mythic, Cobalt Strike, Havoc, or custom agents.\n- Prefer low-signal beacons with jitter, sleep, and obfuscation.\n- Use proxy-aware agents in corporate environments.\n\n## IV. Privilege Escalation & Credential Access\n\n### How do adversaries escalate privileges?\n- Exploit misconfigured sudoers, token impersonation, UAC bypass.\n- Abuse DLL hijacking or custom service installs.\n- Access LSASS memory (via Mimikatz, Nanodump, direct syscalls).\n\n### What credential theft techniques are used?\n- Mimikatz, Rubeus, SharpDPAPI.\n- Dump SAM database / NTDS.dit offline.\n- Phishing users for SSO creds or OAuth tokens.\n- Pass-the-Hash / Pass-the-Ticket (Kerberos).\n\n## V. Lateral Movement\n\n### How is lateral movement performed?\n- WMI, RDP, PsExec, SMB/IPC, WinRM.\n- Use Impacket, SharpHound, CrackMapExec.\n- Blend in: use legit credentials, match parent-child processes.\n\n### How do you avoid detection during lateral movement?\n- Avoid noisy tools (PowerShell, known binaries).\n- Use living-off-the-land binaries (e.g., schtasks, msbuild).\n- Inject into trusted processes and use direct system calls.\n\n## VI. Defense Evasion\n\n### What are core evasion tactics?\n- Process injection (Early Bird, Queue APC, etc.).\n- Obfuscated binaries/scripts (Crypters, custom packers).\n- Command line evasion (encoded, staged, in-memory).\n- EDR bypass using sideloading, AMSI bypass, ETW patching.\n\n### What helps maintain stealth?\n- Slow beaconing, long jitter/delay.\n- Disable logging or anti-virus safely (if permitted).\n- Clean up artifacts (clear logs, delete temp payloads).\n\n## VII. Persistence\n\n### How do attackers maintain persistence?\n- Scheduled tasks, Startup folder, WMI persistence.\n- Registry keys (Run/RunOnce), login items on macOS.\n- Service creation or browser extensions.\n- Cloud: OAuth refresh tokens, malicious Azure apps.\n\n## VIII. Exfiltration & Objectives\n\n### How is data exfiltrated covertly?\n- Exfil via HTTPS or DNS tunneling.\n- Cloud sync abuse (Google Drive, OneDrive).\n- Steganography or data embedding in benign files.\n- Chunk data, compress, encrypt, and send with subtle C2.\n\n### Common objectives:\n- Data theft (PII, source code, credentials).\n- Domain dominance (Golden Ticket, DCsync).\n- Planting long-term access or backdoors.\n- Gaining access to crown-jewel assets (CI/CD, backups).\n\n## IX. Purple Team Execution\n\n### How do red and blue teams collaborate?\n- Red shares exact TTPs with blue in real time or post-op.\n- Use tools like VECTR, Atomic Red Team, Invoke-ATTACKAPI.\n- Purple team goal = enhance detection and response, not “win.”\n- Iterate: simulate > detect > tune > simulate again.\n\n### How are detection gaps identified and addressed?\n- Correlate red TTPs with SIEM/EDR logs.\n- Use MITRE ATT&CK mapping to identify weak coverage.\n- Present in categories: Detected, Partially Detected, Missed.\n- Deliver detection engineering recommendations.\n\n## X. Operational Security (OpSec) and Ethics\n\n### What OpSec considerations must be followed?\n- Avoid harming production systems (DoS, data corruption).\n- Do not trigger security incidents or panic (stealth > chaos).\n- Encrypt all payloads and comms (avoid attribution).\n- Never leave behind persistent artifacts without consent.\n\n### Ethical & legal guidelines?\n- Follow Rules of Engagement (ROE) and get written approvals.\n- Avoid sensitive data unless explicitly authorized.\n- Report unintended access immediately.\n- Be accountable — red teaming is high trust.\n",
      "linksAdded": 1
    },
    {
      "path": "obsidian.main.vault/Notes/Tell Me About Yourself.md",
      "content": "My #Background\n\n~~Thank you for letting me share my [[background]] with you!~~\n\n~~I’m originally Lebanese, but I grew up in the SF Bay Area. Out of high school I was unmotivated and without direction. A lot of my friends were heading off to college at the time, but I didn’t feel like it was something for me.~~ \n\n~~However, I was really drawn to the military, specifically the United States Marine Corps because due to their elite nature. I knew joining would give me the challenge I was looking for and show me what I’m capable of.~~ \n\n~~In the four years I served, I gained more lifelong skills than I could have imagined. Camaraderie, teamwork and honor.~~ \n\n~~Coming out of the Marines, I joined the construction industry:~~\n\n~~I started at a small construction firm and worked my way to the largest contractor in San Francisco, Webcor Builders. It was a significant transition, handling projects like the Facebook’s 43 story building, and The Salesforce Transbay Terminal.  These were high-stake, high-visibility projects where truly thoughtful planning, stakeholder management, and effective team coordination were crucial~~\n\n~~2020 comes around and I was subject to layoffs due to COVID and the economic downturn. After 6+ years in the construction industry, this was the perfect time to transition to an industry that I’ve been deeply passionate about.~~ \n\n~~After doing some entry level certifications like the COMPTIA A+ and the Google professional IT Support, I was pretty much hooked. During this time, I had been following some schools that were top performers in the NCL, and I decided to pursue my bachelor’s degree with SANS and enrolled in November of 2021.~~ \n\n~~During my studies I took on a part time role at Harmony blockchain where I handled communications with victims of theft and investigated IOCs as well as my internship with the SANS ISC were I deployed a couple of honeypots to capture TTP on attackers as well as research different malware that attackers tried to use.~~ \n\n~~The culmination of these experiences brings me to this point I time where I’m excited to join ………….~~",
      "linksAdded": 1
    },
    {
      "path": "obsidian.main.vault/Job Interview Prep/Rapid7/Interview Prep/Behavioral/Difficult Person.md",
      "content": "\n**Situation:**  \nAt Harmony Blockchain, part of my role was handling security‑related communications and coordinating bounties when researchers reported vulnerabilities. In one case, I worked with a really difficult security researcher who felt we were moving too slowly and severely under‑valuing his finding, and his emails and chats became really hostile and demanding.\n\n**Task:**  \nI needed to prevent the situation from escalating publicly, and to make sure we evaluated his report fairly against our bounty policy, and also maintain a professional relationship despite his tone.\n\n**Action:**  \nI focused on separating emotion from facts. I first reviewed his report with our internal team and mapped it against our published bounty criteria—impact, reproducibility, and scope. Instead of continuing the argument over chat, I scheduled a call. On the call, I let him fully explain his perspective, acknowledged the effort he put into the report, and walked him through how our bounty program worked and how his finding scored against the criteria. I offered constructive feedback on how to structure future reports for faster evaluation and set clear timelines for follow‑ups so he knew what to expect. Throughout, I stayed calm, avoided personal language, and kept bringing the conversation back to facts, policy, and next steps.\n\n**Result:**  \nHe never became easy to work with unfortunately, but the tension dropped after that call. We agreed on a bounty amount consistent with our policy, and he didn’t escalate the situation publicly. Internally, I pushed for clearer written bounty guidelines and response time expectations, which reduced ambiguity in future cases. The experience taught me that with difficult people, staying calm, active listening, and grounding the discussion in transparent criteria and next steps is more effective than trying to win the argument.",
      "linksAdded": 1
    },
    {
      "path": "obsidian.main.vault/Job Interview Prep/General Atomics/2 - Cyber Architect - Responsibilities.md",
      "content": "### 1. **<font color=\"#ffff00\">Assessing an Over-arching Set of Environments Including Hardware/System Configurations</font>**\n\n- **Explanation**: This means evaluating all the different environments where technology is used, such as servers, networks, and devices. The goal is to identify any vulnerabilities or weaknesses in these environments.\n- **Example**: A company uses various types of servers, network equipment, and user devices (like laptops and mobile phones). As a Cybersecurity Architect, you would review these configurations to ensure they comply with security best practices, like using secure protocols, disabling unnecessary services, and applying the latest patches.\n\n### 2. **<font color=\"#ffff00\">Develop Security Engineering Solutions for UAS Hardware and Software</font>**\n\n- **Explanation**: UAS stands for Unmanned Aerial Systems, which are often referred to as drones. This duty involves designing security measures specifically for these systems, both for their hardware (physical components) and software (control systems, communication protocols, etc.).\n- **Example**: You might develop encryption methods to protect communication between a drone and its operator or create secure boot mechanisms to ensure the drone only runs trusted software.\n\n### 3. **<font color=\"#ffff00\">Communicate Status of the Project to Stakeholders</font>**\n\n- **Explanation**: This involves regularly updating stakeholders (such as project managers, executives, or clients) on the progress, risks, and challenges of cybersecurity projects.\n- **Example**: During a project to implement a new security solution, you would create regular status reports or presentations detailing the work completed, any issues encountered, and next steps, ensuring all stakeholders are aware and aligned.\n\n### 4. **<font color=\"#ffff00\">Ensure Cyber Risks are Mitigated and Communicated Effectively to the Customer</font>**\n\n- **Explanation**: This involves identifying potential cyber risks (like data breaches or unauthorized access) and taking steps to reduce or eliminate them. Additionally, it requires clear communication with customers to make them aware of these risks and the measures taken to address them.\n- **Example**: If a vulnerability is found in a client's drone software that could allow unauthorized access, you would implement a patch to fix the issue and then inform the customer about the risk, the steps taken to mitigate it, and any recommendations for further action.\n\n### 5. **<font color=\"#ffff00\">Be Responsive to Information Technology Guidelines, Policies, and Directives</font>**\n\n- **Explanation**: This duty means staying current with and adhering to established IT policies, standards, and directives, which could be internal (from the company) or external (from regulatory bodies).\n- **Example**: If there’s a new company policy requiring all systems to use multi-factor authentication (MFA), you must ensure that any security solutions you develop are compliant with this requirement.\n\n### 6. **<font color=\"#ffff00\">Implement and Maintain Security Features in Addition to Developing Test Procedures</font>**\n\n- **Explanation**: This involves both setting up and continually managing security controls (like firewalls, intrusion detection systems, etc.) and developing procedures to test their effectiveness.\n- **Example**: After setting up a new intrusion detection system (IDS), you would create a series of tests to simulate different types of attacks to verify that the IDS can correctly identify and respond to them.\n\n### 7. **<font color=\"#ffff00\">Educate Non-Cybersecurity Personnel About the Cybersecurity Engineering Process and Importance of Cybersecurity</font>**\n\n- **Explanation**: This responsibility involves teaching employees who are not specialized in cybersecurity about the basic principles of cybersecurity and why it is important.\n- **Example**: You might hold training sessions for software developers to teach them secure coding practices or create awareness programs for all staff about the dangers of phishing emails.\n\n### 8. **<font color=\"#ffff00\">An Understanding of Encryption, Firewalls, Antivirus, etc., is Required for This Position</font>**\n\n- **Explanation**: This is a fundamental requirement that expects you to have a solid grasp of core cybersecurity concepts and technologies, such as how encryption works, how firewalls protect networks, and how antivirus software detects and removes malware.\n- **Example**: Knowing how to configure a firewall to block unauthorized traffic while allowing legitimate traffic, or understanding which type of encryption is best for securing communication channels.",
      "linksAdded": 1
    }
  ]
}